import type { Question } from './types';

export const questions: Question[] = [
  {
    id: 1,
    text: '手枪局输了，第二局队友喊着"Eco（攒钱）"，但你手头刚好够起一把正义（Sheriff）加个甲，你会：',
    options: [
      {
        text: '听队友的，标配神力，主打一个陪伴和纪律。',
        weights: { S: 1, O: 1 },
      },
      {
        text: '无脑正义。他们太需要一个人站出来了',
        weights: { W: 1, A: 1 },
      },
      {
        text: '买把短喷开苟，等一个有缘人送枪。',
        weights: { S: 1, B: 1 },
      },
    ],
  },
  {
    id: 2,
    text: '残局 1v3，你方包已经下了，此时你看到对面一个残血正在远路逃跑去保枪，你会：',
    options: [
      {
        text: '稳稳守包，赢了分就行，保持纪律性。',
        weights: { S: 1, O: 1 },
      },
      {
        text: '欢迎来到vctcn，保持歃血。',
        weights: { W: 1, K: 1 },
      },
      {
        text: '赶紧捡起地上别人掉落的长枪，然后跑到十万八千里外保枪。',
        weights: { S: 1, K: 1 },
      },
    ],
  },
  {
    id: 3,
    text: '你玩个奶妈/烟位，队友捷风开局 5 秒冲进包点暴毙，并疯狂对你大喊"奶我/帮我给闪啊！"，你的反应：',
    options: [
      {
        text: '麦克风一开："你冲那么快是赶着投胎？我技能能跨时空给？"',
        weights: { V: 1, A: 1 },
      },
      {
        text: '叹了口气，直接把他语音屏蔽，假装什么都没发生。',
        weights: { M: 1, B: 1 },
      },
      {
        text: '"我的我的，下把一定跟上。"（虽然你明知跟不上）',
        weights: { M: 1, O: 1 },
      },
    ],
  },
  {
    id: 4,
    text: '看到地上掉落了一把大狙（Operator），而你这把玩的是纯辅助位：',
    options: [
      {
        text: '疯狂标点"这里有武器"，让队里的大哥来捡。',
        weights: { S: 1, B: 1 },
      },
      {
        text: '化身流水的zmjjkk',
        weights: { W: 1, A: 2 },
      },
      {
        text: '自己不捡，把狙丢到地图外面',
        weights: { S: 1, O: 1 },
      },
    ],
  },
  {
    id: 5,
    text: '对面防守方在包点封了三个烟，还放了各种绊线和纳米群蜂，你会：',
    options: [
      {
        text: '"这怎么进？转点转点！赶紧打默认。"',
        weights: { S: 1, B: 1 },
      },
      {
        text: '"烟里肯定没人！"直接干拉冲进去瞎搅和。',
        weights: { W: 1, A: 1 },
      },
      {
        text: '站在点外把所有的技能和大招全甩了，假装自己打出了巨大作用。',
        weights: { S: 1, V: 1 },
      },
    ],
  },
  {
    id: 6,
    text: '残局时刻，你观战你的队友，他准星在对面头上描边了整整一梭子被反杀，此时你：',
    options: [
      {
        text: '没忍住按下了语音键："啥情况，ygkbl？"',
        weights: { V: 1, K: 1 },
      },
      {
        text: '面无表情，甚至有点想笑，在公屏打了个"。"。',
        weights: { M: 1, K: 1 },
      },
      {
        text: '深深地吸了一口气，然后重重地叹气，让全队都能听到你的绝望。',
        weights: { V: 1, S: 1 },
      },
    ],
  },
  {
    id: 7,
    text: '进游戏选英雄界面，队友秒锁了三个决斗者，轮到你了：',
    options: [
      {
        text: '老老实实补个烟位或者奶妈，为了赢只能妥协。',
        weights: { S: 1, O: 1 },
      },
      {
        text: '果断锁下第四个决斗者。要什么阵容，杀完不就赢了？',
        weights: { W: 1, K: 1 },
      },
      {
        text: '锁个斯凯或者铁臂，开局警告："不进点我直接闪白你们全家。"',
        weights: { V: 1, B: 1 },
      },
    ],
  },
  {
    id: 8,
    text: '防守方，你守的包点已经整整 30 秒没有任何动静了，你会：',
    options: [
      {
        text: '静步往前摸一摸，看看能不能拿到首杀或者信息。',
        weights: { W: 1, A: 1 },
      },
      {
        text: '敌不动我不动。只要我不露头，危险就追不上我。',
        weights: { S: 1, B: 1 },
      },
      {
        text: '觉得对面肯定在打另一个点，提前轮转过去',
        weights: { S: 1, K: 1 },
      },
    ],
  },
  {
    id: 9,
    text: '12-11 的赛点局，你手里捏着大招但只有 20 滴血，进点前你会：',
    options: [
      {
        text: '让满血的队友先进去拉枪线，自己跟在后面收割保底。',
        weights: { S: 1, K: 1 },
      },
      {
        text: '"看我大招！"直接冲在最前面，用命给队友换空间。',
        weights: { W: 1, O: 1 },
      },
      {
        text: '躲在后排架枪，坚决不打第一闪身，只要我不死就不算输。',
        weights: { S: 1, B: 1 },
      },
    ],
  },
  {
    id: 10,
    text: '你今天手感极差，全场垫底，但队伍比分遥遥领先，你的心态是：',
    options: [
      {
        text: '化身啦啦队长，疯狂夸队友"牛逼哥们，没毛了"',
        weights: { V: 1, O: 1 },
      },
      {
        text: '非常自闭，觉得自己像个废物，赢了也一点都不开心。',
        weights: { M: 1, K: 1 },
      },
      {
        text: '开始疯狂前压抢人头，试图在结束前让自己的 KDA 不那么难看。',
        weights: { W: 1, K: 1 },
      },
    ],
  },
  {
    id: 11,
    text: '你平时的训练方式或者提升自我的方式更偏向于：',
    options: [
      {
        text: '开个自定义房间，研究各种道具。',
        weights: { S: 1, B: 1 },
      },
      {
        text: '进死斗模式疯狂练枪，或者去 AimLabs 练定位。',
        weights: { W: 1, A: 1 },
      },
      {
        text: '练个屁，排位就是最好的热身，进游戏直接点匹配。',
        weights: { W: 1, V: 1 },
      },
    ],
  },
  {
    id: 12,
    text: '作为攻击方，你选择在另一端单摸，结果队友在主攻点被瞬间融化，你会：',
    options: [
      {
        text: '开麦指责："你们等我一下啊！急着去送吗？"',
        weights: { V: 1, S: 1 },
      },
      {
        text: '一言不发，默默面对 1v4 的残局，并试图上演神级翻盘。',
        weights: { M: 1, A: 1 },
      },
      {
        text: '找个下水道蹲好，等时间结束保全你最后的一把长枪。',
        weights: { M: 1, K: 1 },
      },
    ],
  },
  {
    id: 13,
    text: '开局队友经济崩盘求发枪，你手里有 3900 块：',
    options: [
      {
        text: '给他发把狂徒，主打一个团队。',
        weights: { B: 1, O: 1 },
      },
      {
        text: '装作没听见，自己买全甲狂徒，穷死也不能苦了自己。',
        weights: { A: 1, K: 1 },
      },
      {
        text: '买一把大狙把钱花了',
        weights: { W: 1, V: 1 },
      },
    ],
  },
  {
    id: 14,
    text: '转角遇到爱，你被斯凯（Skye）的鸟瞬间全白了，你会：',
    options: [
      {
        text: '凭借肌肉记忆往掩体后跳，切刀跑路。',
        weights: { S: 1, B: 1 },
      },
      {
        text: '按死左键一顿乱扫，哪怕死也要在对面身上留个孔。',
        weights: { W: 1, A: 1 },
      },
      {
        text: '在语音里一边大喊："全白全白！快上！"一边原地转圈。',
        weights: { V: 1, W: 1 },
      },
    ],
  },
  {
    id: 15,
    text: '如果这款游戏明天就要关服，你打的最后一场比赛，你希望你是怎样的姿态？',
    options: [
      {
        text: '用完美的战术和技能配合，和兄弟们一起拿下最后的胜利。',
        weights: { B: 1, O: 1 },
      },
      {
        text: '发信息给对面来个合影',
        weights: { A: 2, W: 1 },
      },
      {
        text: '没什么感觉',
        weights: { S: 1, V: 1 },
      },
    ],
  },
];
